Tekla Open API Reference for Tekla Structures 2025
ArrowheadAttributes.ArrowPosition Property
 The position of the arrowhead. The position is always ArrowheadPositions.Both for dimensions.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrowheadPositions ArrowPosition { get; set; }
Public Property ArrowPosition As ArrowheadPositions
	Get
	Set
Property Value
Type: ArrowheadPositions
See Also
Reference
ArrowheadAttributes Class
Tekla.Structures.Drawing Namespace